Repository: CudaText-addons/cuda_find_in_files
Catalog: lang/*/LC_MESSAGES/cuda_find_*_files.po
Languages: ru_ru

source: +1 level
ru_ru: +1 уровень

source: +2 levels
ru_ru: +2 уровня

source: +3 levels
ru_ru: +3 уровня

source: +4 levels
ru_ru: +4 уровня

source: +5 levels
ru_ru: +5 уровней

source: +All
ru_ru: +Все уровни

source: Only
ru_ru: Тек. папка

source: -Binary
ru_ru: -Двоичные

source: -Hidden
ru_ru: -Скрытые

source: -Hidden, -Binary
ru_ru: -Скрытые, -Двоичные

source: Don't skip
ru_ru: Не пропускать

source: By date, from newest
ru_ru: По дате, начиная со последних

source: By date, from oldest
ru_ru: По дате, начиная со старых

source: Don't sort
ru_ru: Не сортировать

source: Must update the application
ru_ru: Необходимо обновить приложение

source: The command works only with reports of FindInFiles plugin
ru_ru: Команда применима только к результатам "Поиска по файлам"

source: No info to repeat search
ru_ru: Нет данных для повторного поиска

source: Option allows to save separate search settings (search text, source folder, files mask etc) per each mentioned session or project. Each item in the option is RegEx, which is compared with the full path of session (project). First matched item is used.
ru_ru: Сохранять раздельно параметры поисков (списки фрагментов, папки, маски файлов и пр.) для каждой из указанных сессий или проектов. Каждый элемент в перечислении - это регулярное выражение, с которым будет сравниваться полный путь сессии/проекта. Будет использован первый подходящий.

source: History
ru_ru: История

source: Copy options [.*], [aA], ["w"] from CudaText dialog to plugin's dialog.
ru_ru: Копировать настройки [.*], [aA], ["w"] из CudaText диалога Поиск в диалог плагина.

source: Start
ru_ru: Старт

source: Use selection text from current file when dialog opens.
ru_ru: Использовать выделенный в редакторе текст, как фрагмент для поиска.

source: Store Results between dialog call if setting is "[ ]Send".
ru_ru: Сохранять Результаты между вызовами диалога, если "[ ]Вывести".

source: List of lexer names to use for report file. First available lexer is used.
ru_ru: Список имен лексеров для Результатов. Будет применен первый доступный.

source: Report
ru_ru: Отчет

source: Auto-write 'tab_size' to report's lexer-specific config, if no such setting. Use 0 to skip.
ru_ru: Назначать такой 'tab_size' для лексера Результов, если он не задан. Используйте 0, чтобы отключить назначение.

source: Allows Esc key to stop all stages of current search. If false, Esc stops only the current stage.
ru_ru: Применять Esc для остановки сразу всех стадий поиска. Если false, то Esc остановит только текущую стадию.

source: Searching
ru_ru: Поиск

source: Show report even if nothing found.
ru_ru: Показывать Результаты даже если ничего не найдено.

source: [x]Append: Need to fold previous results.
ru_ru: [x]Дополнять: Нужно ли сворачивать предыдущие Результаты.

source: Close dialog if search has found matches.
ru_ru: Закрывать диалог при успешном поиске.

source: Length of substring (from field "Find"), which appears in the report document title.
ru_ru: Ограничение на длину строки (начало поля "Искать"), которая появился в титуле таба.

source: If report document has a filename, save report after filling it.
ru_ru: Автоматически сохранять таб с Результатами, если он уже является файлом.

source: Activate document with report after filling it.
ru_ru: Переходить в таб с Результами после его заполнения.

source: Save search details ("Find", "In folder", …) in the first line of report. The info will be used in command "Repeat search for this report-tab".
ru_ru: Сохранять параметры поиска ("Искать", "В папке", …) в первой строке Результатов. Эта информация может быть использована при вызове команды "Repeat search for this report-tab".

source: Append specified string to the field 'Not in files'.
ru_ru: Всегда добавлять такую строку к значению из поля "Кроме файлов".

source: Size of buffer (at file start) to detect binary files.
ru_ru: Размер начального куска файла, по которому будет диагностироваться его двоичность.

source: If value>0, skip all files, which sizes are bigger than this value (in Kb).
ru_ru: При положительном значении будут пропущены все файлы, у которых размер в Кб больше этого значения.

source: Default encoding to read files. If value is empty, then the following is used: cp1252 for Linux, preferred encoding from locale for others (Win, macOS, …).
ru_ru: Умолчательная кодировка для чтения файлов. Если задано пустое значение, то будут применяться такие кодировки cp1252 для Linux, preferred encoding from locale для остальных (Win, macOS, …).

source: Style to mark found fragment in report. Full form: "fif_mark_style":{ "color_back":"", "color_font":"", "font_bold":false, "font_italic":false, "color_border":"", "borders":{"left":"","right":"","bottom":"","top":""} }, Color values: "" - skip, "#RRGGBB" - hex-digits Values for border sides: "solid", "dash", "2px", "dotted", "rounded", "wave"
ru_ru: Стиль для маркировки в Результатах найденных фрагментов. Полная форма: "fif_mark_style":{ "color_back":"", "color_font":"", "font_bold":false, "font_italic":false, "color_border":"", "borders":{"left":"","right":"","bottom":"","top":""} }, Значения цветов: "" - пропустить, "#RRGGBB" - hex-digits Значения для границ: "solid", "dash", "2px", "dotted", "rounded", "wave"

source: Style to mark replaced fragment in report (unique in line). Full form: "fif_mark_true_replace_style":{ "color_back":"", "color_font":"", "font_bold":false, "font_italic":false, "color_border":"", "borders":{"left":"","right":"","bottom":"","top":""} }, Color values: "" - skip, "#RRGGBB" - hex-digits Values for border sides: "solid", "dash", "2px", "dotted", "rounded", "wave"
ru_ru: Стиль для маркировки в Результатах замененных фрагментов (уникальных в строках). Полная форма: "fif_mark_true_replace_style":{ "color_back":"", "color_font":"", "font_bold":false, "font_italic":false, "color_border":"", "borders":{"left":"","right":"","bottom":"","top":""} }, Значения цветов: "" - пропустить, "#RRGGBB" - hex-digits Значения для границ: "solid", "dash", "2px", "dotted", "rounded", "wave"

source: Style to mark replaced fragment in report (not unique in line). Full form: "fif_mark_false_replace_style":{ "color_back":"", "color_font":"", "font_bold":false, "font_italic":false, "color_border":"", "borders":{"left":"","right":"","bottom":"","top":""} }, Color values: "" - skip, "#RRGGBB" - hex-digits Values for border sides: "solid", "dash", "2px", "dotted", "rounded", "wave"
ru_ru: Стиль для маркировки в Результатах замененных фрагментов (неуникальных в строках). Полная форма: "fif_mark_false_replace_style":{ "color_back":"", "color_font":"", "font_bold":false, "font_italic":false, "color_border":"", "borders":{"left":"","right":"","bottom":"","top":""} }, Значения цветов: "" - пропустить, "#RRGGBB" - hex-digits Значения для границ: "solid", "dash", "2px", "dotted", "rounded", "wave"

source: To view/edit options install plugin "Options Editor"
ru_ru: Для просмотра/изменения нужно установить плагин "Options Editor"

source: "Find in Files" options
ru_ru: Настройки для "Поиска по Файлам"

source: No
ru_ru: Нет

source: Yes
ru_ru: Да

source: No preset to config
ru_ru: Нет пресета для настройки

source: Options is restored from preset
ru_ru: Настройки восстановлены из пресета

source: &Presets:
ru_ru: &Пресеты:

source: &Name:
ru_ru: &Имя:

source: Move &up
ru_ru: Переместить &вверх

source: Move &down
ru_ru: Переместить в&низ

source: Clon&e
ru_ru: Дубл&ировать

source: Dele&te
ru_ru: Удалит&ь

source: &What to restore:
ru_ru: &Что восстановить:

source: With values:
ru_ru: Со значениями:

source: Apply
ru_ru: Применить

source: Cancel
ru_ru: Отменить

source: Presets
ru_ru: Пресеты

source: Save preset
ru_ru: Сохранить пресет

source: &What to save:
ru_ru: &Что сохранить:

source: #{}: "{}" in "{}"
ru_ru: #{}: "{}" в "{}"

source: Options is saved to preset:
ru_ru: Настройки сохранены в пресете:

source: Options is restored from preset:
ru_ru: Настройки восстановлены из пресета:

source: If report will be sent to tab [x] Send then option "Tree type" in dialog "{morp}" allows to set: {shtp}
ru_ru: Если результаты будут в табе [x] Вывести тогда опция "Тип дерева" в диалоге "{morp}" позволяет применить: {shtp}

source: ┌────────────────────────────┬──────────────┬────────────────────────────┬───────────────────────────────────────────┐ │ Command │ Hotkey │ Trick │ Comment │ ╞════════════════════════════╪══════════════╪════════════════════════════╪═══════════════════════════════════════════╡ │ Find │ Enter │ │ If focus not in Results/Source │ │ Count matches │ Alt+T │ │ │ │ Find filenames │ Ctrl+T │ │ │ ├────────────────────────────┼──────────────┼────────────────────────────┼───────────────────────────────────────────┤ │ Focus to Results │ Ctrl+Enter │ │ If focus not in Results/Source │ │ Open found fragment │ Enter │ │ If focus in Results. Selects the fragment │ │ Close and go to found │ Ctrl+Enter │ │ If focus in Results. Selects the fragment │ │ Close and go to found │ Ctrl+Enter │ │ If focus in Source. Restores selection │ │ Fold Results branch │ Ctrl+= │ │ If focus in Results │ ├────────────────────────────┼──────────────┼────────────────────────────┼───────────────────────────────────────────┤ │ In current file │ Ctrl+Shift+C │ Shift+Сlick "Current" │ │ │ In all tabs │ │ Ctrl +Сlick "Current" │ │ │ In current tab │ │ Ctrl+Shift+Сlick "Current" │ │ │ Choose file │ Ctrl+B │ Shift+Сlick "Browse" │ │ │ Depth "Only" │ Alt+Y │ Ctrl+Num0 │ │ │ Depth "+1 level" │ Alt+! │ Ctrl+Num1 │ │ │ Depth "All" │ Alt+L │ Ctrl+Num9 │ │ ├────────────────────────────┼──────────────┼────────────────────────────┼───────────────────────────────────────────┤ │ Save values as preset │ Ctrl+S │ │ │ │ Presets dialog │ Ctrl+Alt+S │ │ │ │ Use Preset #1(..#5) │ Ctrl+1(..5) │ │ Others from menu/dialog │ │ Use Layout #1(..#5) │ Alt+1(..5) │ │ Others from menu │ ├────────────────────────────┼──────────────┼────────────────────────────┼───────────────────────────────────────────┤ │ ±"Not in"/±"Replace" │ Alt+V │ │ 4-states loop to show/hide │ │ Engine options │ Ctrl+E │ │ │ │ Configure vert. alignments │ │ Ctrl+Сlick "=" │ │ ├────────────────────────────┼──────────────┼────────────────────────────┼───────────────────────────────────────────┤ │ Call CudaText's "Find" │ Ctrl+F │ │ With transfer patern/.*/aA/"w" │ │ Call CudaText's "Replace" │ Ctrl+R │ │ With transfer paterns/.*/aA/"w" │ │ Dialog "Help" │ Alt+H │ │ │ └────────────────────────────┴──────────────┴────────────────────────────┴───────────────────────────────────────────┘
ru_ru: ┌───────────────────────────────┬──────────────┬────────────────────────────┬───────────────────────────────────────────┐ │ Команда │ Хоткей │ Трюк │ Комментарий │ ╞═══════════════════════════════╪══════════════╪════════════════════════════╪═══════════════════════════════════════════╡ │ Искать │ Enter │ │ Если фокус не в Результатах/Исходнике │ │ Посчитать фрагменты │ Alt+T │ │ │ │ Найти имена файлов │ Ctrl+T │ │ │ ├───────────────────────────────┼──────────────┼────────────────────────────┼───────────────────────────────────────────┤ │ Активировать Результаты │ Ctrl+Enter │ │ Если фокус не в Результатах/Исходнике │ │ Перейти к фрагменту │ Enter │ │ Если фокус в Результатах │ │ Закрыть и перейти к фрагменту │ Ctrl+Enter │ │ Если фокус в Результатах │ │ Закрыть и перейти к фрагменту │ Ctrl+Enter │ │ Если фокус в Исходнике │ │ Свернуть ветку Результатов │ Ctrl+= │ │ Если фокус в Результатах │ ├───────────────────────────────┼──────────────┼────────────────────────────┼───────────────────────────────────────────┤ │ В текущем файле │ Ctrl+Shift+C │ Shift+Сlick "Текущий" │ │ │ Во всех табах │ │ Ctrl +Сlick "Текущий" │ │ │ В текущем табе │ │ Ctrl+Shift+Сlick "Текущий" │ │ │ Выбрать файл │ Ctrl+B │ Shift+Сlick "Обзор" │ │ │ Глубина "Тек.папка" │ Alt+Y │ Ctrl+Num0 │ │ │ Глубина "+1 уровень" │ Alt+! │ Ctrl+Num1 │ │ │ Глубина "Все" │ Alt+L │ Ctrl+Num9 │ │ ├───────────────────────────────┼──────────────┼────────────────────────────┼───────────────────────────────────────────┤ │ Сохранить как пресет │ Ctrl+S │ │ │ │ Диалог Пресеты │ Ctrl+Alt+S │ │ │ │ Прим. Пресет #1(..#5) │ Ctrl+1(..5) │ │ Остальные доступны из меню/диалога │ │ Прим. Расположение #1(..#5) │ Alt+1(..5) │ │ Остальные доступны из меню │ ├───────────────────────────────┼──────────────┼────────────────────────────┼───────────────────────────────────────────┤ │ ±"Не в файлах"/±"Заменить" │ Alt+V │ │ 4-шаговый цикл показать/спрятать │ │ Глубокие настройки │ Ctrl+E │ │ │ │ Подгонка верт. выравниваний │ │ Ctrl+Сlick "=" │ │ ├───────────────────────────────┼──────────────┼────────────────────────────┼───────────────────────────────────────────┤ │ Перейти в CudaText "Find" │ Ctrl+F │ │ С копированием "Что искать" и .*/aA/"с" │ │ Перейти в CudaText "Replace" │ Ctrl+R │ │ С копированием "Что иск/зам" и .*/aA/"с" │ │ Диалог "Справка" │ Alt+H │ │ │ └───────────────────────────────┴──────────────┴────────────────────────────┴───────────────────────────────────────────┘

source: • ".*" - Option "Regular Expression". It allows to use in field "Find what" special symbols: . any character \d digit character (0..9) \w word-like character (digits, letters, "_") In field "Replace with": \1 to insert first found group, \2 to insert second found group, ... See full documentation on page docs.python.org/3/library/re.html • "w" - {word} —————————————————————————————————————————————— • Values in fields "{incl}" and "{excl}" can contain ? for any single char, * for any substring (may be empty), [seq] any character in seq, [!seq] any character not in seq. Note: * matches all names, *.* doesn't match all. • Values in fields "{incl}" and "{excl}" can filter subfolder names if they start with "/". Example. {incl:12}: /a* *.txt {excl:12}: /ab* {fold:12}: c:/root Depth : All Search will consider all *.txt files in folder c:/root and in all subfolders a* except ab*. • Set special value "{tags}" (in short <t> or <Tabs>) for field "{fold}" to search in opened documents. Fields "{incl}" and "{excl}" will be to filter tab titles. To search in all tabs, use mask "*" in field "{incl}". See: commands in menu/Scope. • Set special value "{proj}" (in short <p>) for field "{fold}" to search in project files. See: commands in menu/Scope. —————————————————————————————————————————————— • Long-term searches can be interrupted by ESC. Search has three stages: picking files, finding fragments, reporting. ESC stops any stage. When picking and finding, ESC stops only this stage, so next stage begins. —————————————————————————————————————————————— • Use right click or Context keyboard button to see context menu over these elements "Find", "Replace", "Current", "Browse", Depth combobox —————————————————————————————————————————————— You are welcome to plugin forum. See bottom link.
ru_ru: • ".*" - Опция "Регулярное выражение". Она позволяет использовать в поле "Что искать" специальные знаки: . любой символ \d цифра (0..9) \w символ для слова (цифра, буква, "_") В поле "Заменить на" специальные знаки: \1 вставить первую найденную группу, \2 вставить вторую найденную группу, ... См. полную справку на странице docs.python.org/3/library/re.html • "с" - {word} —————————————————————————————————————————————— • Строки в полях "{incl}" и "{excl}" могут содержать специальные знаки ? любой символ, * любая подстрока (в том числе пустая), [seq] любой символ из перечисленных, [!seq] любой символ кроме перечисленных. Важно: * задает все файлы, *.* задает только файлы с расширениями. • Строки в полях "{incl}" и "{excl}" могут указывать на подпаки если они начинаются на "/". Пример. {incl:12}: /a* *.txt {excl:12}: /ab* {fold:12}: c:/root Глубина : Все Поиск будет просматривать все файлы *.txt в папке c:/root и всех подпапках a* кроме ab*. —————————————————————————————————————————————— • Специальная строка "{tags}" (есть короткие варианты <t> или <Tabs>) в поле "{fold}" указывает, что нужно искать в открытых документах. При этом маски из "{incl}" и "{excl}" будут применяться к надписям на ярлыках табов. Для поиска по всем табам, задайте маску "*" в "{incl}". • Специальная строка "{proj}" (короткий вариант <p>) в поле "{fold}" указывает, что нужно искать в файлах текущего проекта. См. команды в меню "Что просматривать". —————————————————————————————————————————————— • Долгий поиск можно прервать с помощью ESC. Весь поиск делится на три последовательные стадии: Сбор подходящих файлов, Выделение подходящих фрагментов, Составление отчета о результатах. ESC прерывает текущую стадию поиска. Если это была не последняя стадия, то запускается следующая с теми данными, которые успели накопиться. —————————————————————————————————————————————— • Клик ПКМ или клавишей "Контекстное меню" над элементами "Искать", "Заменить", "Текущий", "Обзор", список уровней отображает контекстное меню. —————————————————————————————————————————————— Замечания и предложения можно оставлять на форуме плагина. Ссылка внизу.

source: "Find in Files" help
ru_ru: "Поиск по файлам" - справка

source: Hotkeys+Tricks
ru_ru: Хоткеи+Трюки

source: Hints
ru_ru: Советы

source: Tree types
ru_ru: Типы деревьев

source: Plugin forum
ru_ru: Форум плагина

source: See "mouse_goto_definition" in default.json and user.json
ru_ru: См. "mouse_goto_definition" в default.json и user.json

source: <no action>
ru_ru: <нет реакции>

source: Navigate to same group
ru_ru: Показать в этой же группе табов

source: Navigate to next group
ru_ru: Показать в следующей группе табов

source: Navigate to prev group
ru_ru: Показать в предыдущей группе табов

source: Navigate to next group, activate
ru_ru: Показать в следующей группе табов, передать фокус

source: Navigate to prev group, activate
ru_ru: Показать в предыдущей группе табов, передать фокус

source: Configure found result navigation by double-click
ru_ru: Настройка двойного клика для результатов поиска

source: Space-separated file or folder masks. Folder mask starts with "/". Double-quote mask, which needs space-char. Use ? for any character and * for any fragment. Note: "*" matchs all names, "*.*" doesnt match all.
ru_ru: Маски файлов и папок (разделитель - пробел). Маски файлов начинаются с "/". Используйте двойные кавычки для масок, содержащих пробелы. Используйте "?" для указания произвольного символа и "*" для произвольной строки. Внимание: маска "*" задает все файлы, а "*.*" задает только файлы с расширениями.

source: Always excluded: {} See option "fif_always_not_in_files" to change.
ru_ru: Всегда исключены: {} Настройка через опцию "fif_always_not_in_files".

source: Regular expression Format for found groups in Replace: \1
ru_ru: Регулярное выражение При Замене формат найденных групп: \1

source: Case sensitive
ru_ru: С учетом регистра

source: Option "Whole words". It is ignored when: Regular expression (".*") is turned on, "Find what" contains not only letters, digits and "_".
ru_ru: "Полное слово". Опция игнорируется если: Включена Регулярное выражение (".*"), "Что искать" содержит не только буквы, цифры и "_".

source: Choose folder. Shift+Click or Ctrl+B - Choose file to find in it.
ru_ru: Выбрать папку. Shift+Click или Ctrl+B - Выбрать файл для поиска в нем.

source: Start folder(s). Space-separated folders. Double-quote folder, which needs space-char. ~ is user Home folder. $VAR or ${{VAR}} is environment variable. {} to search in tabs (in short <Tabs> or <t>). {} to search in project folders (in short <p>).
ru_ru: Исходная папка(и). Разделитель для папок пробел. Используйте двойные кавычки, если пробел есть в имени. ~ домашняя папка пользователя. $VAR или ${{VAR}} переменная окружения. {} для поиска по табам (сокращения <Tabs> или <t>). {} для поиска по файлам проекта (сокращение <p>).

source: Which subfolders will be searched. Alt+Y or Ctrl+Num0 - Apply "Only". Alt+! or Ctrl+Num1 - Apply "+1 level". Alt+L or Ctrl+Num9 - Apply "+All" subfolders.
ru_ru: В каких подпапках искать. Alt+Y или Ctrl+Num0 - Назначить "Только в текущей". Alt+! или Ctrl+Num1 - Назначить "+1 уровень". Alt+L или Ctrl+Num9 - Назначить "+Все уровни".

source: Use folder of current file. Shift+Click or Ctrl+Shift+C - Prepare search in the current file. Ctrl+Click - Prepare search in all tabs. Shift+Ctrl+Click - Prepare search in the current tab.
ru_ru: Использовать папку текущего файла. Shift+Click или Ctrl+Shift+C - Подготовить поиск в текущем файле. Ctrl+Click - Подготовить поиск по всем табам. Shift+Ctrl+Click - Подготовить поиск в текущем табе.

source: Advanced search options
ru_ru: Дополнительные опции

source: Output report to tab/file
ru_ru: Выводить результаты в таб/файл

source: Advanced tab report options
ru_ru: Дополнительные опции для результатов в табе

source: Local menu Ctrl+Click - Adjust vertical alignments...
ru_ru: Локальное меню Ctrl+Click - Подгонка вертикальных выравниваний...

source: Show/Hide advanced options Ctrl+Click - Show/Hide "Not in files". Shift+Click - Show/Hide "Replace". Alt+V - Toggle visibility on cycle hidden "Not in files", hidden "Replace" visible "Not in files", hidden "Replace" visible "Not in files", visible "Replace" hidden "Not in files", visible "Replace"
ru_ru: Показать/Спрятать дополнения Ctrl+Click - Показать/Спрятать "Кроме файлов". Shift+Click - Показать/Спрятать "Заменить". Alt+V - Переключать показ по циклу нет "Кроме файлов", нет "Заменить" есть "Кроме файлов", нет "Заменить" есть "Кроме файлов", есть "Заменить" нет "Кроме файлов", есть "Заменить"

source: M[, F] Stop after M fragments will be found. Search only inside F first proper files. Note: If Sort is on then steps are - Collect all proper files - Sort the list - Use first F files to search
ru_ru: M[, F] Остановить, когда найдено M фрагментов. Искать только в F первых файлах. Внимание: Если включена Сортировка, то происходит так - Собирается список всех подходящих файлов - Список сортируется - Используются первые F файлов

source: day(s)
ru_ru: день(и)

source: hour(s)
ru_ru: час(ы)

source: month(s)
ru_ru: месяц(ы)

source: week(s)
ru_ru: неделя(и)

source: year(s)
ru_ru: год(а)

source: "N" or "<N" or ">N". Skip files if the age less or more then N. "N" and "<N" are equal. "0" to all ages.
ru_ru: "N" или "<N" или ">N". Пропускать файлы, чей возраст меньше или больше N. "N" и "<N" задают одно и то же. "0" любой возраст.
