Repository: CudaText-addons/cuda_find_in_files
Catalog: lang/*/LC_MESSAGES/cuda_find_*_files.po
Languages: ru_ru

source: Format of the reported tree structure. Compact - report all found line with full file info: path(r[:c:l]):line path/(r[:c:l]):line Tree schemes +Search for "*" <full_path(row[:col:len])>: line with ALL marked fragments +Search for "*" <full_path>: #count <(row[:col:len])>: line with ALL marked fragments Sparse - report separated folders and fragments: dir/file(r[:c:l]):line dir/file/(r[:c:l]):line Tree schemes +Search for "*" <root>: #count <dir>: #count <file.ext(row[:col:len])>: line with ONE marked fragment +Search for "*" <root>: #count <dir>: #count <file.ext>: #count <(row[:col:len])>: line with ONE marked fragment For sorted files and for search in tabs In folder={} only Compact options are used. When a conflict occurs, "Tree type" is automatically changed.
ru_ru: Форматы для дерева Результатов. Компактные - описание найденных фрагментов занимает минимум строк: path(r[:c:l]):line path/(r[:c:l]):line Примеры результатов +Search for "*" <full_path(row[:col:len])>: строка со ВСЕМИ найденными в ней фрагментами +Search for "*" <full_path>: #count <(row[:col:len])>: строка со ВСЕМИ найденными в ней фрагментами Разреженные - раздельное описание найденных файлов и фрагментов: dir/file(r[:c:l]):line dir/file/(r[:c:l]):line Примеры результатов +Search for "*" <root>: #count <dir>: #count <file.ext(row[:col:len])>: строка со ОДНИМ найденным в ней фрагментом +Search for "*" <root>: #count <dir>: #count <file.ext>: #count <(row[:col:len])>: строка со ОДНИМ найденным в ней фрагментом Если задана сортировка файлов или задан поиск по табам, то есть В папке={} то доступны только компактные типы для дерева. Если тип дерева некомпактный, то произойдет автоматическая замена по похожий компактный.

source: Conte&xt -{}+{}
ru_ru: Бли&жайшие -{}+{}

source: Show result line and both its nearest lines, above and below result.
ru_ru: Показывать найденные строки вместе с их ближайшими до и после.

source: Align columns (filenames/numbers) by widest cell width
ru_ru: Выравнивать имена файлов и позиции фрагментов

source: Start search. Shift+Click - Put report to new tab. It is like pressing Find with option "Show in: {}". Ctrl+Click - Append result to existing report. It is like pressing Find with option "[x]Append results".
ru_ru: Начать поиск. Shift+Click - Вывести результаты в новый таб. Совпадает с вызовом Искать при настройке "Показать в: {}". Ctrl+Click - Добавить предыдущим результатам. Совпадает с вызовом Искать при настройке "[x]Дополнять результаты".

source: Start search and replacement. Shift+Click - Run without question "Do you want to replace...?"
ru_ru: Начать поиск с заменой. Shift+Click - Пропустить вопрос "Выполнить замены в...?"

source: Count matches only. Shift+Click or Ctrl+T - Find file names only. Note: Alt+T and Ctrl+T works if button is hidden.
ru_ru: Посчитать число совпадений. Shift+Click или Ctrl+T - Найти только имена файлов. Внимание: Alt+T и Ctrl+T работают при скрытой кнопке.

source: Save options for future. Restore saved options. Shift+Click - Show presets list in applying history order. Ctrl+Click - Apply last used preset. Note: Alt+S works if button is hidden. Ctrl+1 - Apply first preset. Ctrl+2 - Apply second preset. Ctrl+3 - Apply third preset.
ru_ru: Сохранить/Восстановить настройки. Shift+Click - Показать список пресетов в поредке их последнего применения. Ctrl+Click - Применить последний пресет. Внимание: Alt+S работает при скрытой кнопке. Ctrl+1 - Применить первый пресет. Ctrl+2 - Применить второй пресет. Ctrl+3 - Применить третий пресет.

source: In which encodings try to read files. First suitable will be used. "{}" is slow. Default encoding: {}
ru_ru: Какие кодировки пробовать при чтении файлов. До первой успешно примененной. Операция "{}" выполняется долго. Умолчательная кодировка: {}

source: [Clear fixed files]
ru_ru: [Забыть все имена файлов]

source: [Add fixed file]
ru_ru: [Добавить новое имя файла]

source: (no results)
ru_ru: (нет результатов)

source: Find in Files ({})
ru_ru: Поиск по файлам ({})

source: sorted
ru_ru: с сортировкой

source: age
ru_ru: возраст

source: first "
ru_ru: первые "

source: append to
ru_ru: добавлять к

source: Report:
ru_ru: Вывести в:

source: aligned
ru_ru: с выравниванием

source: context-{}+{}
ru_ru: ближайшие-{}+{}

source: Search:
ru_ru: Поиск:

source: S&kip files:
ru_ru: &Пропускать:

source: S&ort file list:
ru_ru: &Сортировать:

source: A&ge (0=all):
ru_ru: &Возраст (0=все):

source: &Firsts (0=all):
ru_ru: Перв&ые (0=все):

source: &Encodings:
ru_ru: &Кодировки:

source: Clear all fixed files ({}) for "{}"?
ru_ru: Удалить все имена файлов ({}) для "{}"?

source: Report to
ru_ru: Результаты в

source: &Report to:
ru_ru: &Результаты в:

source: Appen&d results
ru_ru: &Дополнять результаты

source: &Tree type:
ru_ru: &Тип дерева:

source: &Align (r:c:l)
ru_ru: &Выравнивание (r:c:l)

source: Add conte&xt lines
ru_ru: Добавить &ближайшие строки

source: &Before:
ru_ru: П&еред:

source: A&fter:
ru_ru: П&осле:

source: detect
ru_ru: выявлять

source: <{}> (search setting)
ru_ru: <{}> (параметр поиска)

source: Source encoding
ru_ru: Кодировки Исходника

source: <ERROR. See "Source encoding" in menu>
ru_ru: <ERROR. Проверьте через меню "Кодировка исходника">

source: (no source)
ru_ru: (нет исходника)

source: Do you want to replace in {}?
ru_ru: Выполнить замены в {}?

source: current tab
ru_ru: текущем табе

source: all tabs
ru_ru: всех табах

source: all found files
ru_ru: всех найденных файлах

source: Fix quotes in the "{}" field
ru_ru: Исправьте кавычки в "{}"

source: Fill the "{}" field
ru_ru: Укажите значение в "{}"

source: Set correct "{}" reg.ex. Error: {}
ru_ru: Исправьте рег.выражение "{}" Error: {}

source: Set existing folder in "{}" or use "{}" or use "{}". =/Presets can help.
ru_ru: Укажите существующую папку в "{}" или используйте "{}" или используйте "{}". =/Пресеты могут помочь.

source: file
ru_ru: файл

source: tab
ru_ru: таб

source: Search stopped
ru_ru: Поиск остановлен

source: No {}s picked
ru_ru: Нет подходящих {}ов

source: No matches found (in {} {})
ru_ru: Фрагменты не найдены (в {} {})

source: Found {} {} in {}({}) {}
ru_ru: Найдено {} {} в {}({}) {}

source: Remove "{}"?
ru_ru: Удалить "{}"?

source: Name "{}" already used. Overwrite?
ru_ru: Имя "{}" уже используется. Продолжить?

source: Apply layout: {}
ru_ru: Применить раскладку: {}

source: Results
ru_ru: Результаты

source: Open fragment
ru_ru: Открыть фрагмент

source: Go to fragment
ru_ru: Перейти к фрагменту

source: Fold branch
ru_ru: Свернуть ветку

source: Copy Results to tab
ru_ru: Скопировать Результаты в таб

source: Count matches only
ru_ru: Посчитать фрагменты

source: Find file names only
ru_ru: Найти имена файлов

source: Find and replace
ru_ru: Искать и заменять

source: Find and replace (without question) [Shift+"{}"]
ru_ru: Искать и заменять (без вопроса) [Shift+"{}"]

source: Find
ru_ru: Искать

source: Find and put report to new tab [Shift+"{}"]
ru_ru: Искать и выводить результаты в новый таб [Shift+"{}"]

source: Find and append result to existing report [Ctrl+"{}"]
ru_ru: Искать и дополнять результаты [Ctrl+"{}"]

source: Use folder of current file
ru_ru: Использовать папку текущего файла

source: Prepare search in the current file [Shift+"{}"]
ru_ru: Подготовить поиск по текущему файлу [Shift+"{}"]

source: Prepare search in all tabs [Ctrl+"{}"]
ru_ru: Подготовить поиск по всем табам [Ctrl+"{}"]

source: Prepare search in the current tab [Shift+Ctrl+"{}"]
ru_ru: Подготовить поиск в текущем табе [Shift+Ctrl+"{}"]

source: Fill "{}" to find in project folders
ru_ru: Заполнить "{}" для поиска в папках проекта

source: Fill "{}" to find in tabs
ru_ru: Заполнить "{}" для поиска в табах

source: Choose folder…
ru_ru: Выбрать папку…

source: Choose file to find in it…
ru_ru: Выбрать файл для поиска внутри него…

source: Apply "Onl&y" [Ctrl+Num0]
ru_ru: Применить "Только в текущей папке" [Ctrl+Num0]

source: Apply "+1 level" [Ctrl+Num1]
ru_ru: Применить "+1 уровень" [Ctrl+Num1]

source: Apply "+A&ll" [Ctrl+Num9]
ru_ru: Применить "+Все уровни" [Ctrl+Num9]

source: Options for report t&o tab…
ru_ru: Опции для Результатов в таб…

source: Extra options for s&earch…
ru_ru: Доп. опции для поиска…

source: &View and edit engine options…
ru_ru: Глубокие опции поиска…

source: &Configure navigation with double-click in tab report…
ru_ru: Настройка действий при двойном клике в табе с Результатами…

source: Source encod&ing{}…
ru_ru: Кодировка исходника…

source: Show "{}"
ru_ru: Показать "{}"

source: Show "{}" and "{}"
ru_ru: Показать "{}" и "{}"

source: &Save preset as…
ru_ru: Сохранит пресет как…

source: Presets [{}]…
ru_ru: Пресеты [{}]…

source: Set Results o&ver Source
ru_ru: Расположить Результаты над Исходником

source: &Save dialog and controls positions...
ru_ru: Сохранить расположение...

source: &{}: Restore "{}"
ru_ru: &{}: Восстановить "{}"

source: &Forget
ru_ru: Забыть

source: &Find
ru_ru: Поиск

source: Sco&pe
ru_ru: Что просматривать

source: &Browse
ru_ru: Об&зор

source: &Depth
ru_ru: Глубина

source: Pre&sets
ru_ru: Пресеты

source: &Layout
ru_ru: Расположение

source: &Help…
ru_ru: Справка…

source: &aA
ru_ru: &аА

source: "&w"
ru_ru: "&с"

source: *&Find what:
ru_ru: *&Что искать:

source: &Replace with:
ru_ru: &Заменить на:

source: *&In files:
ru_ru: *В &файлах:

source: Not in files:
ru_ru: Не в файлах:

source: *I&n folder:
ru_ru: *В &папке:

source: &Browse…
ru_ru: Об&зор…

source: &Current
ru_ru: Теку&щий

source: For s&earch…
ru_ru: Для по&иска…

source: Sen&d
ru_ru: В&ывести

source: t&o…
ru_ru: &в…

source: Re&place
ru_ru: Заменить

source: <Project Folders>
ru_ru: <Папки Проекта>

source: <Open Files>
ru_ru: <Открытые файлы>

source: <prior tab>
ru_ru: <прежний таб>

source: <new tab>
ru_ru: <новый таб>

source: {} for "{}" in "{}" from {} ({} matches in {}({}) files)
ru_ru: {} для "{}" в "{}" из {} ({} фрагментов в {}({}) файлах)

source: {} "{}" to "{}" in "{}" from {} ({} changes in {}({}) files)
ru_ru: {} "{}" в "{}" в "{}" из {} ({} изменений в {}({}) файлах)

source: [ESC?] Report: {}%
ru_ru: [ESC?] Результаты: {}%

source: (Report stopped on {}%)
ru_ru: (Выдача Результатов прервана на {}%)

source: No tab for navigation
ru_ru: Нет таба для перехода

source: No file for navigation
ru_ru: Нет файла для перехода

source: Line {} has bad data for navigation
ru_ru: Строка {} не содержит данных для перехода

source: Undefined report to jump. Fill new report or navigate with old one.
ru_ru: Результаты не подходят для перехода. Получите новые результаты.

source: Command doesn't work with multi-carets
ru_ru: Команда не работает с несколькими каретками

source: Line "{}":{} has no data for navigation
ru_ru: Строка "{}":{} не содержит данных для перехода

source: No data to jump
ru_ru: Нет данных для перехода

source: Line {} has no data for navigation
ru_ru: Строка {} не содержит данных для перехода

source: [ESC?] Search: {}% [found {} matches in {}({}) files]
ru_ru: [ESC?] Поиск: {}% [найдено {} фрагментов в {}({}) файлах]

source: (Search stopped on {}%)
ru_ru: (Поиск прерван на {}%)

source: Cannot read "{}" (encoding={}/{}): {}
ru_ru: Невозможно прочитать "{}" (кодировка={}/{}): {}

source: tab:
ru_ru: таб:

source: [ESC?][Found {} file(s) in {} dir(s)] Picking in: {}
ru_ru: [ESC?][Найдено {} файлов в {} папках] Просмотр: {}

source: (Picking stopped)
ru_ru: (Просмотр прерван)

source: Stop?
ru_ru: Прервать?
